#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//int main()
//{
//	char a = 3;
//	// 按照变量的数据类型的符号位来提升。   /
//	// 00000000000000000000000000000011
//	// 被截断后 a 的值 -- 00000011
//	char b = 127;
//	// 00000000000000000000000001111111
//	//        b的值      01111111
//
//	// a 和 b 如何相加
//	// 00000000000000000000000000000011
//	// 00000000000000000000000001111111
//	// 00000000000000000000000010000010
//
//	char c = a + b;
//	// 10000010  -- c
//	// 11111111111111111111111110000010   -- 补码
//	// 11111111111111111111111110000001   -- 反码
//	// 10000000000000000000000001111110   -- 原码
//	// -126
//	printf("%d\n", c);
//	return 0;
//}

//实例1
//int main()
//{
//	char a = 0xb6;            
//	short b = 0xb600;
//	int c = 0xb6000000;
//	if (a == 0xb6)              
//		printf("a");
//	if (b == 0xb600)
//		printf("b");
//	if (c == 0xb6000000)
//		printf("c");
//	return 0;
//}

//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));  
//	printf("%u\n", sizeof(+c));
//	printf("%u\n", sizeof(!c));
//	return 0;
//}

int main()
{
	int a = 10;
	int b = 20;
	int c = b + a * 3;
	return 0;
}